Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can now describe how you want security information to be stored in the model by adding annotations to the `user` entity, as outlined in the following code snippet:
ja_jp: 次のコードで説明するように、 `user` エンティティにアノテーションを追加することで、セキュリティ情報をどのようにモデルに格納したいかを記述することができます:

source: You can now interact with your REST service:
ja_jp: これで、REST サービスと対話できるようになりました。

source: You can now interact with your reactive REST service:
ja_jp: これで、リアクティブな REST サービスと対話できるようになりました。

source: You can now push the image and release it.
ja_jp: これで、イメージをプッシュしてリリースできるようになりました。

source: You can now query the whole map with all the fields:
ja_jp: これで、すべてのフィールドを含むマップ全体のクエリーが可能になりました:

source: You can now schedule jobs programmatically by using the Scheduler programmatic API, described in the link:/guides/scheduler-reference#programmatic_scheduling[Scheduler reference guide].
ja_jp: link:/guides/scheduler-reference#programmatic_scheduling[Schedulerのリファレンスガイド] に記載されているScheduler programmatic APIを使用することで、プログラム的にジョブをスケジュールできるようになりました。

source: You can now use this assistant in any JsonRPC method, example:
ja_jp: これで、任意の JsonRPC メソッドでこのアシスタントを使用できます。例:

source: You can now write your first endpoint in the `org.acme.rest.Endpoint` class:
ja_jp: これで、 `org.acme.rest.Endpoint` クラスで最初のエンドポイントを書くことができます:

source: You can observe OIDC events related to the authentication, logout, etc. See the xref:security-oidc-code-flow-authentication.adoc#listen-to-authentication-events[Listento OIDC events] section for more information.
ja_jp: 認証、ログアウトなどに関連する OIDC イベントを監視できます。詳細は xref:security-oidc-code-flow-authentication.adoc#listen-to-authentication-events[OIDC イベントのリスニング] セクションを参照してください。

source: You can observe an https://quarkus.io/guides/security-openid-connect-multitenancy#programmatic-startup[Oidc startup event] and register one or more OIDC tenants using `OicTenantConfig` builder API.
ja_jp: https://quarkus.io/guides/security-openid-connect-multitenancy#programmatic-startup[Oidc startup event] を監視し、 `OicTenantConfig` ビルダー API を使用して 1 つ以上の OIDC テナントを登録できます。

source: You can observe the various kind of events using:
ja_jp: 次を利用して様々な種類のイベントを観察することができます:

source: You can obtain a fragment programmatically via the `io.quarkus.qute.Template.getFragment(String)` method.
ja_jp: `io.quarkus.qute.Template.getFragment(String)` メソッドにより、プログラム的にフラグメントを取得することができます。

source: You can obtain more information about AOT cache usage with the `-Xlog:aot` option.
ja_jp: `-Xlog:aot` オプションを使用すると、AOT キャッシュの使用状況に関する詳細情報を取得できます。

source: You can of course create a native executable following the instructions of the xref:building-native-image.adoc[Building native executables] guide.
ja_jp: もちろん、 xref:building-native-image.adoc[ネイティブ実行可能ファイルの作成] ガイドの手順に従ってネイティブ実行可能ファイルを作成することもできます。

source: You can of course create a native executable following the instructions of the xref:building-native-image.adoc[this guide].
ja_jp: もちろん、xref:building-native-image.adoc[このガイド] に記載された手順で、ネイティブ実行可能ファイルを作成することもできます。

source: You can of course create a native executable following the instructions of xref:building-native-image.adoc[this guide].
ja_jp: もちろん、xref:building-native-image.adoc[このガイド] に記載された手順で、ネイティブ実行可能ファイルを作成することもできます。

source: You can of course create a native image using instructions similar to xref:building-native-image.adoc[this] guide.
ja_jp: もちろん、 xref:building-native-image.adoc[こ] のガイドと同様の手順でネイティブイメージを作成することもできます。

source: You can of course create a native image using the instructions of the xref:building-native-image.adoc[Building a native executable guide].
ja_jp: もちろん、 xref:building-native-image.adoc[ネイティブ実行可能ファイルのビルド]の手順でネイティブイメージを作成することもできます。

source: You can of course disable the health check of the `quarkus-kafka-streams` extension by setting the `quarkus.kafka-streams.health.enabled` property to `false` in your `application.properties`.
ja_jp: もちろん、 `quarkus-kafka-streams` エクステンションのヘルスチェックを無効にすることもできます。 `application.properties` の中で `quarkus.kafka-streams.health.enabled` を `false` にしてください。

source: You can omit the `@Inject` annotation when using `@RedisClientName`.
ja_jp: `@RedisClientName` を使用する場合、 `@Inject` アノテーションを省略することができます。

source: You can optionally add a logo (dark and light mode) in `deployment/src/main/resources/dev-ui/`.
ja_jp: `deployment/src/main/resources/dev-ui/` にロゴ (ダークモードとライトモード) を任意で追加できます。

source: You can output all logs to the console by setting the exporter to `logging` in the `application.properties` file:
ja_jp: `application.properties` ファイルで exporter を `logging` に設定すれば、すべてのログをコンソールに出力できます：

source: You can output all metrics to the console by setting the exporter to `logging` in the `application.properties` file:
ja_jp: `application.properties` ファイルでエクスポーターを `logging` に設定して、すべてのメトリクスをコンソールに出力できます。

source: You can output all metrics to the console, for debugging/development purposes.
ja_jp: デバッグ/開発目的で、すべてのメトリクスをコンソールに出力できます。

source: You can override `quarkus.oidc.auth-server-url` if you have created your account in another Mastodon server, for example:
ja_jp: 他のマストドンサーバーでアカウントを作成した場合など、 `quarkus.oidc.auth-server-url` を上書きすることができます：

source: You can override it in your `application.properties` explicitly (e.g. `%prod.quarkus.hibernate-orm.sql-load-script = import.sql`) but we wanted you to avoid overriding your database by accident in prod :)
ja_jp: `application.properties` で明示的にオーバーライドできます。 (例: `%prod.quarkus.hibernate-orm.sql-load-script = import.sql`) ただし、 実稼働環境で誤ってデータベースをオーバーライドすることは避けたいと考えています :)

source: You can override the annotations parameters at runtime inside your `application.properties` file.
ja_jp: `application.properties` ファイルの中で、実行時にアノテーションパラメータをオーバーライドすることができます。

source: You can override the configuration by adding the following lines to the `application.properties`:
ja_jp: 以下の行を `application.properties` に追加することで、設定を上書きすることができます。

source: You can override the profile the executable *runs* with during the test using the `quarkus.test.integration-test-profile` property. Either by adding it to `application.properties` or by appending it to the command line: `./mvnw verify -Dnative -Dquarkus.test.integration-test-profile=test`. Your `%test.` prefixed properties will be used at the test runtime.
ja_jp: テスト中に実行ファイルが *動作* する際のプロファイルは、`quarkus.test.integration-test-profile` プロパティーを使用してオーバーライドできます。`application.properties` に追加するか、コマンドラインに付加してください: `./mvnw verify -Dnative -Dquarkus.test.integration-test-profile=test`。テスト実行時には、`%test.` 接頭辞の付いたプロパティーが使用されます。

source: You can override the profile the executable *runs* with during the test using the `quarkus.test.native-image-profile` property. Either by adding it to `application.properties` or by appending it to the command line: `./mvnw verify -Dnative -Dquarkus.test.native-image-profile=test`. Your `%test.` prefixed properties will be used at the test runtime.
ja_jp: `quarkus.test.native-image-profile` プロパティを使用して、テスト中に実行可能ファイルが *実行* されるプロファイルをオーバーライドできます。 `application.properties` に追加するか、次のようにコマンドラインに追加してください: `./mvnw verify -Dnative -Dquarkus.test.native-image-profile=test`。 接頭辞 `%test.` が付いたプロパティーは、テスト実行時に使用されます。

source: You can override the profile the executable *runs* with during the test using the `quarkus.test.native-image-profile` property. Either by adding it to `application.properties` or by appending it to the command line: `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test`. Your `%test.` prefixed properties will be used at the test runtime.
ja_jp: `quarkus.test.native-image-profile` プロパティを使用して、テスト中に実行可能ファイルが *実行* されるプロファイルを上書きすることができます。 `application.properties` に追加するか、次のようにコマンドラインに追加してください： `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test` 。あなたの `%test.` プリフィックスプロパティは、テストの実行時に使用されます。

source: You can override the profile the executable is *built* with and *runs* with using the `quarkus-profile=test` property, e.g. `./mvnw clean verify -Pnative -Dquarkus-profile=test`. This might come handy if there are test specific resources to be processed, such as importing test data into the database.
ja_jp: `quarkus-profile=test` プロパティを使用すると、実行可能ファイルが *ビルド* されて *実行さ* れるプロファイルを上書きできます （例: `./mvnw clean verify -Pnative -Dquarkus-profile=test` ）。これは、テストデータをデータベースにインポートするような、テスト固有のリソースを処理する場合に便利でしょう。

source: You can override the profile the executable is *built* with and *runs* with using the `quarkus.profile=test` property, e.g. `./mvnw clean verify -Dnative -Dquarkus.profile=test`. This might come handy if there are test specific resources to be processed, such as importing test data into the database.
ja_jp: `quarkus-profile=test` プロパティーを使用すると、実行可能ファイルが *ビルド* されて *実行さ* れるプロファイルをオーバーライドできます (例: `./mvnw clean verify -Dnative -Dquarkus.profile=test`）。これは、データベースへのテストデータのインポートなど、テスト固有のリソースを処理する場合に便利です。

source: You can override these scopes with `quarkus.oidc.authentication.scopes` property, for example, if you work with `Google` and would not like to have an `email` scope added to access tokens:
ja_jp: たとえば、 `Google` を使用していて、アクセストークンに `email` スコープを追加しない場合は、 `quarkus.oidc.authentication.scopes` プロパティーを使用してこれらのスコープをオーバーライドできます。

source: You can override this behaviour using the https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/Blocking.html[`@Blocking`] and https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/NonBlocking.html[`@NonBlocking`] annotations. This can be applied at the method, class or `jakarta.ws.rs.core.Application` level.
ja_jp: link:https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/Blocking.html[@Blocking] と link:https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/NonBlocking.html[@NonBlocking] アノテーションを使用してこの動作をオーバーライドすることができます。これは、メソッド、クラス、 `jakarta.ws.rs.core.Application` の各レベルで適用することができます。

source: You can override this behaviour using the https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/Blocking.html[`@Blocking`] and https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/NonBlocking.html[`@NonBlocking`] annotations. This can be applied at the method, class or `javax.ws.rs.core.Application` level.
ja_jp: https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/Blocking.html[`@Blocking`] アノテーションと https://javadoc.io/doc/io.smallrye.common/smallrye-common-annotation/1.5.0/io/smallrye/common/annotation/NonBlocking.html[`@NonBlocking`] アノテーションを使用してこの動作をオーバーライドできます。これは、メソッド、クラス、または `javax.ws.rs.core.Application` レベルで適用できます。

source: You can override this by setting the `transactions` configuration property - see the <<configuration-reference, Configuration Reference>> below.
ja_jp: これを上書きするには、 `transactions` 設定プロパティーを設定します。以下の <<configuration-reference, Configuration Reference>> を参照してください。

source: You can override this by setting the `transactions` configuration property:
ja_jp: `transactions` 設定プロパティーを設定することで、これをオーバーライドできます。

source: You can pass `@BeanParam` directly into a `@PermissionChecker` method and access its fields programmatically. Ability to reference `@BeanParam` fields with the `@PermissionsAllowed#params` attribute is useful when you have multiple differently structured `@BeanParam` classes.
ja_jp: `@BeanParam` を `@PermissionChecker` メソッドに直接渡し、プログラムでそのフィールドにアクセスできます。 `@PermissionsAllowed#params` 属性を使用して `@BeanParam` フィールドを参照する機能は、異なる構造の `@BeanParam` クラスが複数ある場合に便利です。

source: You can pass data gathered during build to the Page (js):
ja_jp: ビルド中に収集されたデータを Page (js) に渡すことができます。

source: You can pass extra CSS for your page in the `style` template parameter
ja_jp: `style` テンプレートパラメーターで、ページに追加の CSS を渡すことができます。

source: You can pass extra JavaScript for your page in the `script` template parameter. This will be added inline after the JQuery script, so you can safely use JQuery in your script.
ja_jp: `script` テンプレートパラメータで、ページ用の追加JavaScriptを渡すことができます。これは、JQuery スクリプトの後にインラインで追加されるため、スクリプト内で安全に JQuery を使用することができます。

source: You can pass extra parameter to upx, such as `--brute` or `--ultra-brute` using the `quarkus.native.compression.additional-args` parameter. The value is a comma-separated list of arguments:
ja_jp: `quarkus.native.compression.additional-args` パラメータを使って `--brute` や `--ultra-brute` のような追加のパラメータを upx に渡すことができます。この値は、コンマで区切られた引数のリストです。

source: You can pass query parameters by index (1-based) as shown below:
ja_jp: 以下のように、インデックス（1ベース）でクエリーパラメーターを渡すことができます:

source: You can pass query parameters, for both native and PanacheQL queries, by index (1-based) as shown below:
ja_jp: ネイティブクエリとPanacheQLクエリの両方で、以下のようにインデックス（1から始まる）ごとにクエリパラメータを渡すことができます。

source: You can populate a `CaffeineCache` using the `CaffeineCache#put(Object, CompletableFuture)` method. This method associates the `CompletableFuture` with the given key in the cache. If the cache previously contained a value associated with the key, the old value is replaced by this `CompletableFuture`. If the asynchronous computation fails, the entry will be automatically removed.
ja_jp: `CaffeineCache` にデータを追加するには `CaffeineCache#put(Object, CompletableFuture)` メソッドを使います。 このメソッドは `CompletableFuture` をキャッシュ内の与えられたキーと関連付けます。キャッシュに以前からそのキーに関連する値が入っていた場合、古い値はこの `CompletableFuture` に置き換えられます。非同期計算が失敗した場合、そのエントリは自動的に削除されます。

source: You can press the `Space bar` key and the application will be started again. You can also use the `e` hotkey to edit the command line arguments and restart your application.
ja_jp: `スペースバー` キーを押せば、アプリケーションが再び起動します。また、 `e` ホットキーを使って、コマンドライン引数を編集し、アプリケーションを再起動することもできます。

source: You can programmatically have access to the web links registry just by injecting the `RestLinksProvider` bean:
ja_jp: `RestLinksProvider` Bean を挿入するだけで、プログラムで Web リンクレジストリーにアクセスできます。

source: You can provide a data map instead.
ja_jp: 代わりにデータマップを提供することができます。

source: You can provide custom options for the `native-image` command using the `<quarkus.native.additional-build-args>` property. Multiple options may be separated by a comma.
ja_jp: `<quarkus.native.additional-build-args>` プロパティーを使用して、 `native-image` コマンドにカスタムオプションを指定できます。複数のオプションはカンマで区切ることができます。

source: You can provide custom options for the `native-image` command using the `quarkus.native.additional-build-args` and `quarkus.native.additional-build-args-append` properties. Multiple options may be separated by a comma.
ja_jp: `quarkus.native.additional-build-args` および `quarkus.native.additional-build-args-append` プロパティーを使用して、`native-image` コマンドにカスタムオプションを指定できます。複数のオプションはカンマで区切ることができます。

source: You can provide the arguments that Kubernetes Job uses through the `quarkus.openshift.arguments` property. For example, adding the property `quarkus.openshift.arguments=A,B`.
ja_jp: Kubernetes Jobが使用する引数は、 `quarkus.openshift.arguments` プロパティを通して提供できます。 例えば、 `quarkus.openshift.arguments=A,B` プロパティを追加してください。

source: You can provide the arguments that will be used by the Kubernetes Job via the property `quarkus.kubernetes.arguments`. For example, by adding the property `quarkus.kubernetes.arguments=A,B`.
ja_jp: Kubernetes Jobで使用される引数は、プロパティー `quarkus.kubernetes.arguments` で指定できますたとえば、`quarkus.kubernetes.arguments=A,B`というプロパティーを追加することで。

source: You can provide the arguments that will be used by the Kubernetes Job via the property `quarkus.openshift.arguments`. For example, adding the property `quarkus.openshift.arguments=A,B`.
ja_jp: Kubernetes Jobで使用される引数は、プロパティ `quarkus.openshift.arguments` で提供できます。例えば、 `quarkus.openshift.arguments=A,B` というプロパティを追加します。

source: You can provide your own secret key for encrypting the PKCE code verifier if you prefer with the `quarkus.oidc.authentication.state-secret` property but note that this secret should be 32 characters long, and an error will be reported if it is less than 16 characters long.
ja_jp: `quarkus.oidc.authentication.state-secret`プロパティーを使用して、PKCE コード検証を暗号化する独自の秘密鍵を提供することもできますが、 このシークレットの長さは 32 文字である必要があり、16 文字未満の場合、エラーが報告されることに注意してください。

source: You can put all your JPA column annotations on the public fields. If you need a field to not be persisted, use the `@Transient` annotation on it. If you need to write accessors, you can:
ja_jp: すべてのJPAのカラムアノテーションをパブリックフィールドにつけることができます。永続化されないフィールドが必要な場合は、 `@Transient` アノテーションを使用します。アクセサを書く必要があれば、それも可能です:

source: You can put all your Jakarta Persistence column annotations on the public fields. If you need a field to not be persisted, use the `@Transient` annotation on it. If you need to write accessors, you can:
ja_jp: publicフィールドには、すべてのJakarta Persistenceのカラムアノテーションを付けることができます。永続化しないフィールドが必要な場合は、 `@Transient` アノテーションをそのフィールドに使用します。アクセサーを書く必要がある場合は、次のようにできます:

source: You can put your service and message definitions in the `src/main/proto` directory. `quarkus-maven-plugin` will generate Java files from your `proto` files.
ja_jp: サービスとメッセージの定義は `src/main/proto` ディレクトリーに置くことができます。 `quarkus-maven-plugin` は、`proto` ファイルから Java ファイルを生成します。

source: You can read more about Dev Services in the xref:dev-services.adoc[Dev Services] guide, including a list of Dev Services provided by platform extensions.
ja_jp: プラットフォームエクステンションによって提供される Dev Services のリストを含む Dev Services の詳細は、xref:dev-services.adoc[Dev Services] ガイドを参照してください。

source: You can read more about UBI images on:
ja_jp: UBI イメージの詳細については、以下をご覧ください:

source: You can read more about https://infinispan.org/docs/stable/titles/developing/developing.html#clustered_counters[clustered counters] in the Infinispan documentation.
ja_jp: 詳細は Infinispan のドキュメント https://infinispan.org/docs/stable/titles/developing/developing.html#clustered_counters[クラスタカウンター] を参照してください。

source: You can read more about https://infinispan.org/docs/stable/titles/developing/developing.html#creating_ickle_queries-querying[querying] in the Infinispan documentation.
ja_jp: 詳細は Infinispan のドキュメント https://infinispan.org/docs/stable/titles/developing/developing.html#creating_ickle_queries-querying[問い合せ] を参照してください。

source: You can read more about https://infinispan.org/docs/stable/titles/query/query.html[querying] in the Infinispan documentation.
ja_jp: 詳細は Infinispan のドキュメントの https://infinispan.org/docs/stable/titles/query/query.html[クエリ] を参照してください。

source: You can read more on supported method signatures in the link:{rm_doc_method_signatures}[SmallRye Reactive Messaging – Supported signatures].
ja_jp: サポートされるメソッド署名の詳細は、リンク:{rm_doc_method_signatures}[SmallRye Reactive Messaging – サポートされる署名] を参照してください。

source: You can read more on the emitters and channels in the link:{rm_doc_emitter}[SmallRye Reactive Messaging – Emitter and Channels] documentation.
ja_jp: エミッターとチャネルの詳細は、リンク:{rm_doc_emitter}[SmallRye Reactive Messaging – エミッターとチャネル] のドキュメントを参照してください。

source: You can receive it using a `JsonObject`
ja_jp: それを、 `JsonObject` を使用して受け取ることができます。

source: You can refer to Hibernate Search's reference documentation for more information about configuring loading:
ja_jp: ロードの設定に関する詳細は、Hibernate Search のリファレンスドキュメントを参照してください。

source: You can reference a custom policy by configuring the built-in permission sets that are defined in the `application.properties` file, as outlined in the following configuration example:
ja_jp: 次の設定例に示すように、 `application.properties` ファイルで定義されている組み込みの権限セットを設定することで、カスタムポリシーを参照できます。

source: You can reference a named query instead of a (simplified) HQL query by prefixing its name with the '#' character. You can also use named queries for count, update and delete queries.
ja_jp: 名前付きのクエリーは、その名前の前に「#」文字を付けることで、（簡易）HQLクエリーの代わりに参照することができます。また、名前付きのクエリーは、カウント、更新、削除のクエリーにも使用できます。

source: You can reference nested properties by using the `.` (dot) separator, as in `${x.factor}`.
ja_jp: `${x.factor}` の よ う に、 `.` （ド ッ ト ） セパレーターを用い る こ と で、 入れ子にな っ たプ ロ パテ ィ を参照す る こ と がで き ます。

source: You can reference to https://kiegroup.github.io/kogito-online/#/download[Business Modeler Hub] to download the latest platforms supported for the https://github.com/kiegroup/kogito-tooling/releases[Kogito tooling releases].
ja_jp: こちらの link:https://github.com/kiegroup/kogito-tooling/releases[Kogito toolingリリース] でサポートされている最新のプラットフォームをダウンロードすることができます。

source: You can register `plugins`, `job-listeners` and `trigger-listeners` through Quarkus configuration.
ja_jp: Quarkusの設定から、 `plugins` 、 `job-listeners` 、 `trigger-listeners` を登録することができます。

source: You can register a Quarkus extension registry as a Nexus repository proxy.You need to be an administrator to perform these operations.
ja_jp: QuarkusエクステンションレジストリをNexusリポジトリプロキシとして登録できます。これらの操作を行うには、管理者である必要があります。

source: You can register a `quarkus.oidc.TokenIntrospectionCache` provider to support a custom token introspection cache implementation, as an alternative to the default cache implementation described in the <<caching-verification-results>> section.
ja_jp: <<caching-verification-results>> セクションで説明されているデフォルトのキャッシュ実装の代わりに、カスタムのトークンイントロスペクションキャッシュ実装をサポートするために `quarkus.oidc.TokenIntrospectionCache` プロバイダーを登録できます。

source: You can register a `quarkus.oidc.UserInfoCache` provider to support a custom `UserInfo` cache implementation, as an alternative to the default cache implementation described in the <<caching-verification-results>> section.
ja_jp: <<caching-verification-results>> セクションで説明されているデフォルトのキャッシュ実装の代わりに、カスタムの `UserInfo` キャッシュ実装をサポートするために `quarkus.oidc.UserInfoCache` プロバイダーを登録できます。

source: You can register a custom Jose4j Validator to customize the JWT claim verification process. See the xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator-bearer[Jose4j] section for more information.
ja_jp: カスタム Jose4j Validator を登録して、JWT クレーム検証プロセスをカスタマイズできます。詳細は xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator-bearer[Jose4j] セクションを参照してください。

source: You can register a custom Jose4j Validator to customize the JWT claim verification process. See the xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator[Jose4j] section for more information.
ja_jp: カスタムJose4j Validatorを登録して、JWTクレーム検証プロセスをカスタマイズできます。詳細は xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator[Jose4j ]の セクションを参照してください。

source: You can register a custom [Jose4j Validator] to customize the JWT claim verification process. See xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator[Jose4j] section for more information.
ja_jp: カスタム [Jose4j Validator] を登録して、JWT クレーム検証プロセスをカスタマイズできます。詳細は、xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator[Jose4j] セクションを参照してください。

source: You can register a custom https://www.javadoc.io/doc/org.bitbucket.b_c/jose4j/latest/org/jose4j/jwt/consumer/class-use/Validator.html[Jose4j Validator] to customize the JWT claim verification process, before `org.eclipse.microprofile.jwt.JsonWebToken` is initialized. For example:
ja_jp: `org.eclipse.microprofile.jwt.JsonWebToken` が初期化される前に、カスタム https://www.javadoc.io/doc/org.bitbucket.b_c/jose4j/latest/org/jose4j/jwt/consumer/class-use/Validator.html[Jose4j Validator] を登録して、JWT クレーム検証プロセスをカスタマイズできます。 以下に例を示します。

source: You can register a custom template locator or parse a template manually and put the reulst in the cache via `Engine.putTemplate(String, Template)`.
ja_jp: カスタムテンプレートロケータを登録するか、テンプレートを手動で解析して、 `Engine.putTemplate(String, Template)` を介してキャッシュに格納することができます。

source: You can register a custom template locator using `EngineBuilder.addLocator()` or parse a template manually and put the result in the cache via `Engine.putTemplate(String, Template)`.
ja_jp: カスタムテンプレートロケーターは `EngineBuilder.addLocator()` を使って登録するか、テンプレートを手動で解析して、`Engine.putTemplate(String, Template)` で結果をキャッシュに格納することができます。
